'''
Користувач з клавіатури вводить список чисел. 
Необхідно знайти у списку найдовшу послідовність елементів, що зростають, і вивести її довжину та самі елементи.
Приклад:
    - Вхідні дані:
        - Список чисел: 1, 2, 1, 2, 3, 4, 1.
    - Очікуваний результат:
        - Довжина послідовності: 4.
        - Послідовність: [1, 2, 3, 4].
'''

# 1. Користувач вводить числа в input
# 2. split() розділяє рядок по комам та створює список рядків з числами
# 3. Генеруємо новий список перетворюючи кожен елемент на int
numbers = [int(num) for num in input("Введіть список чисел через кому: ").split(', ')]

# 4. Пошук послідовностей зростання
sequences = [] # Список для збереження всіх послідовностей зростання
current_sequence = [numbers[0]] # Тимчасовий список для пошуку послідовності, починаємо з першого числа

# Перебираємо циклом всі числа
# Нам потрібні індекси, тому використовуємо range()
# Починаємо з 1 (нульовий елемент вже додали до списку)
# Завершуємо len(numbers) - довжина списку чисел
for i in range(1, len(numbers)):
    # якщо поточне число більше за попереднє, додаємо в поточну послідовність
    if numbers[i] > numbers[i - 1]: 
        current_sequence.append(numbers[i])
    else: # в іншому випадку - зростаюча послідовність завершена
        sequences.append(current_sequence) # додаємо поточну послідовність в список
        current_sequence = [numbers[i]] # починаємо формування нової послідовності

sequences.append(current_sequence) # додаємо останню послідовність до списку

# 5. Шукаємо послідовність з максимальною довжиною
max_len = len(sequences[0]) # припускаємо, що перша послідовність найбільша
max_len_index = 0

# Перебираємо в циклі всі послідовності
for i in range(1, len(sequences)):
    # Якщо поточна послідовність більше за попередню - знайшли новий максимум
    if len(sequences[i]) > max_len:
        max_len = len(sequences[i])
        max_len_index = i

# 6. Виводимо результат
print(f"Довжина послідовності: {max_len}")
print(f"Послідовність: {sequences[max_len_index]}")